jsammarco/ESP32-ST-Link-v2-Clone/RAZ Vape Apps/Doom/src/doom.c
/*
 * doom.c -- original Doom-style pocket raycaster for Raz DC25000.
 *
 * This is deliberately a new game implementation: the maze, enemy art, HUD,
 * and renderer are all local to this example.  It does not use or contain any
 * assets or game data from the commercial Doom releases.
 *
 * Controls
 *   PA3, active high draw-pressure signal: fire (game input only)
 *   one short PA7 tap:                    turn right after a brief tap window
 *   two short PA7 taps:                   turn left without an intermediate turn
 *   PA7 held for 145 ms:                  walk forward; repeats while held
 *
 * The PA3 draw signal also drives the coil at the same time as the weapon.
 * It has an idle-low arm, a two-scan debounce, normal-mode 50% duty, an
 * immediate release stop, and a hard 1.8 s cutoff latched until release.
 */

#include <stdint.h>

#include "app.h"
#include "display.h"
#include "n32g031.h"
#include "system.h"
#include "vape.h"

#define VIEW_W              48u
#define VIEW_PIXELS_W       96u
#define VIEW_H              96u
#define VIEW_LEFT           16u
#define VIEW_TOP            16u
#define HUD_Y              128u
#define Q12               4096

#define BUTTON_HOLD_MS     145u
#define DOUBLE_TAP_MS      300u
#define TURN_STEP           14u
#define WALK_STEP          390
#define WALK_REPEAT_MS     100u
#define SHOT_REPEAT_MS     185u
#define COIL_MAX_MS       1800u
#define RENDER_CHUNK_ROWS    8u
#define SCREEN_OFF_CLICKS    10u
#define SCREEN_OFF_WINDOW  2200u
#define GAME_SLEEP_TIMEOUT_MS 30000u

#define ENEMY_COUNT          4u

#define C_CEILING      COL_RGB( 20,  15,  20)
#define C_FLOOR        COL_RGB( 56,  26,  18)
#define C_FLOOR_LINE   COL_RGB( 76,  34,  21)
#define C_HUD          COL_RGB( 29,  25,  22)
#define C_HUD_EDGE     COL_RGB(150,  42,  22)
#define C_GUN_DARK     COL_RGB( 27,  28,  32)
#define C_GUN          COL_RGB(118, 124, 130)
#define C_GUN_LIGHT    COL_RGB(190, 185, 168)
#define C_IMP_DARK     COL_RGB( 64,  18,  14)
#define C_IMP          COL_RGB(163,  46,  25)
#define C_IMP_LIGHT    COL_RGB(224,  83,  34)
#define C_IMP_HORN     COL_RGB(196, 151,  91)

typedef struct {
    int32_t x;
    int32_t y;
    uint8_t health;
    uint8_t alive;
} Enemy;

typedef struct {
    int16_t x;
    int16_t y;
    int16_t width;
    int16_t height;
    uint16_t depth;
    uint8_t hurt;
    uint8_t valid;
} ScreenEnemy;

/* Q12 sine table for one quadrant.  Angle 0 points east; +64 points south. */
static const int16_t sin_quarter[65] = {
       0,  101,  201,  301,  401,  501,  601,  700,
     799,  897,  995, 1092, 1189, 1285, 1380, 1474,
    1567, 1660, 1751, 1842, 1931, 2019, 2106, 2191,
    2276, 2359, 2440, 2520, 2598, 2675, 2751, 2824,
    2896, 2967, 3035, 3102, 3166, 3229, 3290, 3349,
    3406, 3461, 3513, 3564, 3612, 3659, 3703, 3745,
    3784, 3822, 3857, 3889, 3920, 3948, 3973, 3996,
    4017, 4036, 4052, 4065, 4076, 4085, 4091, 4095,
    4096
};

/* 10 x 10 original arena.  Values select wall palette/material. */
static const uint8_t s_map[10][10] = {
    {1,1,1,1,1,1,1,1,1,1},
    {1,0,0,0,0,0,0,0,0,1},
    {1,0,2,2,0,3,0,2,0,1},
    {1,0,0,2,0,3,0,2,0,1},
    {1,3,0,0,0,0,0,0,0,1},
    {1,3,0,2,3,3,2,0,3,1},
    {1,0,0,2,0,0,2,0,0,1},
    {1,0,2,2,0,2,2,0,0,1},
    {1,0,0,0,0,0,0,0,0,1},
    {1,1,1,1,1,1,1,1,1,1}
};

static const int32_t s_spawn_x[ENEMY_COUNT] = {
    5 * Q12 + Q12 / 2, 7 * Q12 + Q12 / 2,
    7 * Q12 + Q12 / 2, 2 * Q12 + Q12 / 2
};
static const int32_t s_spawn_y[ENEMY_COUNT] = {
    1 * Q12 + Q12 / 2, 4 * Q12 + Q12 / 2,
    8 * Q12 + Q12 / 2, 7 * Q12 + Q12 / 2
};

static Enemy   g_enemies[ENEMY_COUNT];
static uint16_t g_zbuf[VIEW_W];
static uint8_t  g_wall_top[VIEW_W];
static uint8_t  g_wall_bottom[VIEW_W];
static uint16_t g_wall_color[VIEW_W];
static ScreenEnemy g_screen_enemies[ENEMY_COUNT];
/* A 96 x 8 strip keeps the 3D view compact and reduces each frame to twelve
 * contiguous SPI transfers, instead of hundreds of individual LCD windows. */
static uint16_t g_frame_buffer[VIEW_PIXELS_W * RENDER_CHUNK_ROWS];
static int32_t  g_player_x;
static int32_t  g_player_y;
static uint8_t  g_angle;
static uint8_t  g_health;
static uint8_t  g_ammo;
static uint8_t  g_kills;
static uint8_t  g_wave;
static uint8_t  g_dead;
static uint8_t  g_hud_dirty;
static uint8_t  g_muzzle_frames;
static uint8_t  g_tap_pending;
static uint8_t  g_long_press;
static uint8_t  g_second_tap;
static uint8_t  g_short_clicks;
static uint8_t  g_screen_off;
static uint8_t  g_scene_dirty;
static uint8_t  g_ignore_wake_release;
static uint8_t  g_death_overlay_drawn;
static uint16_t g_press_started;
static uint16_t g_tap_started;
static uint16_t g_last_short_click;
static uint16_t g_last_walk;
static uint16_t g_last_shot;
static uint16_t g_last_enemy_step;
static uint16_t g_last_damage;
static uint16_t g_clear_started;
static uint16_t g_coil_started;
static uint8_t  g_coil_active;
static uint8_t  g_coil_cutoff_latched;

/* PA3 is the actual factory active-high draw input (from the original dump).
 * Requiring a low observation first avoids treating boot-time stale high as an
 * input; both the weapon and its safeguarded coil session use this signal. */
static uint8_t g_draw_armed;
static uint8_t g_draw_high_scans;

/* Original 12 x 20 demon art. It is scaled into the raycast view at runtime;
 * spaces are transparent, D is the dark outline, B/L are body shades, H is
 * horn/claw material, and Y is the eye glow. */
static const char s_imp_art[20][13] = {
    "  H      H  ",
    " HH      HH ",
    " HHD    DHH ",
    "  DDDDDDDD  ",
    " DDBBBBBBDD ",
    "DDBBBBBBBBDD",
    "DBBYYBBYYBBD",
    "DBBDYBBYDBBD",
    "DBBBBBBBBBBD",
    "DBBBBDDBBBBD",
    "DDBBBBBBBBDD",
    "DBLLBBBBLLBD",
    "DBLBBBBBBLBD",
    "HDLBBBBBBLDH",
    " DDDBBBBDDD ",
    "  DDBBBBDD  ",
    "  DBBDDBBD  ",
    "  DBB  BBD  ",
    " DDBD  DBDD ",
    " HHD    DHH ",
};

/* Compact 3 x 5 UI font: A-Z, 0-9, colon, dash. */
static const uint8_t s_font[38][5] = {
    {2,5,7,5,5}, {6,5,6,5,6}, {3,4,4,4,3}, {6,5,5,5,6},
    {7,4,6,4,7}, {7,4,6,4,4}, {3,4,5,5,3}, {5,5,7,5,5},
    {7,2,2,2,7}, {1,1,1,5,2}, {5,5,6,5,5}, {4,4,4,4,7},
    {5,7,7,5,5}, {5,7,7,7,5}, {2,5,5,5,2}, {6,5,6,4,4},
    {2,5,5,7,3}, {6,5,6,5,5}, {3,4,2,1,6}, {7,2,2,2,2},
    {5,5,5,5,7}, {5,5,5,5,2}, {5,5,7,7,5}, {5,5,2,5,5},
    {5,5,2,2,2}, {7,1,2,4,7}, {7,5,5,5,7}, {2,6,2,2,7},
    {6,1,2,4,7}, {6,1,3,1,6}, {5,5,7,1,1}, {7,4,6,1,6},
    {3,4,6,5,2}, {7,1,2,2,2}, {2,5,2,5,2}, {2,5,3,1,6},
    {0,2,0,2,0}, {0,0,7,0,0}
};

