jsammarco/ESP32-ST-Link-v2-Clone/RAZ Vape Apps/Doom/src/doom.c
static int16_t sin_q12(uint8_t angle)
{
    uint8_t q = (uint8_t)(angle >> 6);
    uint8_t i = (uint8_t)(angle & 63u);

    if (q == 0u) return sin_quarter[i];
    if (q == 1u) return sin_quarter[64u - i];
    if (q == 2u) return (int16_t)-sin_quarter[i];
    return (int16_t)-sin_quarter[64u - i];
}

static int16_t cos_q12(uint8_t angle)
{
    return sin_q12((uint8_t)(angle + 64u));
}

static int32_t iabs32(int32_t value)
{
    return (value < 0) ? -value : value;
}

static uint16_t darken(uint16_t color)
{
    uint8_t r = (uint8_t)((color >> 11) & 0x1Fu);
    uint8_t g = (uint8_t)((color >> 5) & 0x3Fu);
    uint8_t b = (uint8_t)(color & 0x1Fu);
    return (uint16_t)(((r >> 1) << 11) | ((g >> 1) << 5) | (b >> 1));
}

static uint8_t map_is_open(int32_t x, int32_t y)
{
    int32_t mx = x >> 12;
    int32_t my = y >> 12;
    return (mx > 0 && mx < 9 && my > 0 && my < 9 && s_map[my][mx] == 0u);
}

static void draw_input_init(void)
{
    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    GPIOA->MODER &= ~(3UL << (3u * 2u));
    GPIOA->PUPDR &= ~(3UL << (3u * 2u));
    g_draw_armed = 0u;
    g_draw_high_scans = 0u;
}

static uint8_t draw_input_active(void)
{
    if (!GPIO_READ(GPIOA, 3u)) {
        g_draw_armed = 1u;
        g_draw_high_scans = 0u;
        return 0u;
    }
    if (!g_draw_armed) return 0u;
    if (g_draw_high_scans < 2u) g_draw_high_scans++;
    return (g_draw_high_scans >= 2u) ? 1u : 0u;
}

static void coil_stop(void)
{
    vape_coil_off();
    g_coil_active = 0u;
}

/* The game shares the factory PA3 draw signal with its weapon.  Normal mode
 * alternates coil power each game frame (50% duty), matching Launcher normal
 * mode.  A completed 1.8 s draw must return low before it can fire again. */
static void update_coil(uint32_t frame, uint16_t now, uint8_t drawing)
{
    if (g_dead || !drawing) {
        if (!drawing) g_coil_cutoff_latched = 0u;
        coil_stop();
        return;
    }

    if (!g_coil_active) {
        if (g_coil_cutoff_latched) return;
        g_coil_active = 1u;
        g_coil_started = now;
    }

    if ((uint16_t)(now - g_coil_started) >= COIL_MAX_MS) {
        g_coil_cutoff_latched = 1u;
        coil_stop();
        return;
    }

    if ((frame & 1u) == 0u) vape_coil_on();
    else vape_coil_off();
}

static int font_index(char c)
{
    if (c >= 'A' && c <= 'Z') return c - 'A';
    if (c >= '0' && c <= '9') return 26 + c - '0';
    if (c == ':') return 36;
    if (c == '-') return 37;
    return -1;
}

static void draw_char(uint16_t x, uint16_t y, char c, uint8_t scale, uint16_t color)
{
    int index = font_index(c);
    uint8_t row;

    if (index < 0) return;
    for (row = 0u; row < 5u; row++) {
        uint8_t bits = s_font[index][row];
        uint8_t col = 0u;
        while (col < 3u) {
            uint8_t first;
            if (!(bits & (1u << (2u - col)))) {
                col++;
                continue;
            }
            first = col;
            while (col < 3u && (bits & (1u << (2u - col)))) col++;
            display_fill_rect((uint16_t)(x + first * scale),
                              (uint16_t)(y + row * scale),
                              (uint16_t)((col - first) * scale), scale, color);
        }
    }
}

static void draw_text(uint16_t x, uint16_t y, const char *text, uint8_t scale, uint16_t color)
{
    while (*text) {
        if (*text != ' ') draw_char(x, y, *text, scale, color);
        x = (uint16_t)(x + 4u * scale);
        text++;
    }
}

static void draw_number(uint16_t x, uint16_t y, uint8_t value, uint8_t scale, uint16_t color)
{
    if (value >= 100u) {
        draw_char(x, y, (char)('0' + value / 100u), scale, color);
        x = (uint16_t)(x + 4u * scale);
        value = (uint8_t)(value % 100u);
        draw_char(x, y, (char)('0' + value / 10u), scale, color);
        x = (uint16_t)(x + 4u * scale);
        draw_char(x, y, (char)('0' + value % 10u), scale, color);
    } else if (value >= 10u) {
        draw_char(x, y, (char)('0' + value / 10u), scale, color);
        draw_char((uint16_t)(x + 4u * scale), y,
                  (char)('0' + value % 10u), scale, color);
    } else {
        draw_char(x, y, (char)('0' + value), scale, color);
    }
}

static uint16_t wall_color(uint8_t wall, int32_t distance, uint8_t side, uint8_t column)
{
    uint16_t color;
    if (wall == 2u) color = COL_RGB(137, 61, 35);       /* rusty steel */
    else if (wall == 3u) color = COL_RGB(101, 93, 54);  /* toxic masonry */
    else color = COL_RGB(126, 119, 110);                /* concrete */

    if (side || distance > 11500) color = darken(color);
    if (distance > 20500) color = darken(color);
    if ((column & 5u) == 0u) color = darken(color);     /* cheap texture grain */
    return color;
}

/* DDA ray cast.  All positions/directions are Q12. */
static int32_t cast_ray(int32_t px, int32_t py, int32_t rdx, int32_t rdy,
                        uint8_t *wall_out, uint8_t *side_out)
{
    int mx = (int)(px >> 12);
    int my = (int)(py >> 12);
    int stepx = (rdx >= 0) ? 1 : -1;
    int stepy = (rdy >= 0) ? 1 : -1;
    int32_t fracx = px - ((int32_t)mx << 12);
    int32_t fracy = py - ((int32_t)my << 12);
    int32_t ddx;
    int32_t ddy;
    int32_t sdx;
    int32_t sdy;
    uint8_t side = 0u;
    int tries;

    if (rdx == 0) ddx = sdx = 0x3FFFFFFF;
    else if (rdx > 0) {
        ddx = (Q12 * Q12) / rdx;
        sdx = (Q12 - fracx) * Q12 / rdx;
    } else {
        ddx = (Q12 * Q12) / -rdx;
        sdx = fracx * Q12 / -rdx;
    }

    if (rdy == 0) ddy = sdy = 0x3FFFFFFF;
    else if (rdy > 0) {
        ddy = (Q12 * Q12) / rdy;
        sdy = (Q12 - fracy) * Q12 / rdy;
    } else {
        ddy = (Q12 * Q12) / -rdy;
        sdy = fracy * Q12 / -rdy;
    }

    for (tries = 0; tries < 32; tries++) {
        if (sdx < sdy) {
            sdx += ddx;
            mx += stepx;
            side = 0u;
        } else {
            sdy += ddy;
            my += stepy;
            side = 1u;
        }
        if (mx < 0 || mx >= 10 || my < 0 || my >= 10) {
            *wall_out = 1u;
            *side_out = side;
            return 60000;
        }
        if (s_map[my][mx]) {
            *wall_out = s_map[my][mx];
            *side_out = side;
            return side ? (sdy - ddy) : (sdx - ddx);
        }
    }

