jsammarco/ESP32-ST-Link-v2-Clone/RAZ Vape Apps/Doom/src/doom.c
    *wall_out = 1u;
    *side_out = side;
    return 60000;
}

static void build_wall_projection(void)
{
    uint8_t column;
    int16_t dirx = cos_q12(g_angle);
    int16_t diry = sin_q12(g_angle);
    int32_t planex = (-(int32_t)diry * 2700) >> 12;
    int32_t planey = ((int32_t)dirx * 2700) >> 12;

    for (column = 0u; column < VIEW_W; column++) {
        int32_t camera = (int32_t)(2u * column) - 63;
        int32_t rayx = dirx + planex * camera / 64;
        int32_t rayy = diry + planey * camera / 64;
        int32_t distance;
        int32_t wall_h;
        uint8_t wall;
        uint8_t side;

        distance = cast_ray(g_player_x, g_player_y, rayx, rayy, &wall, &side);
        if (distance < 1) distance = 1;
        g_zbuf[column] = (distance > 65535) ? 65535u : (uint16_t)distance;
        wall_h = (VIEW_H * Q12) / distance;
        if (wall_h > (int32_t)VIEW_H) wall_h = (int32_t)VIEW_H;
        g_wall_top[column] = (uint8_t)((VIEW_H - wall_h) / 2);
        g_wall_bottom[column] = (uint8_t)(g_wall_top[column] + wall_h);
        g_wall_color[column] = wall_color(wall, distance, side, column);
    }
}

static void project_enemies(void)
{
    uint8_t i;
    int16_t dirx = cos_q12(g_angle);
    int16_t diry = sin_q12(g_angle);

    for (i = 0u; i < ENEMY_COUNT; i++) {
        Enemy *enemy = &g_enemies[i];
        ScreenEnemy *sprite = &g_screen_enemies[i];
        int32_t dx;
        int32_t dy;
        int32_t forward;
        int32_t right;
        int32_t scaled_forward;
        int center;
        int width;
        int height;
        uint8_t column;

        sprite->valid = 0u;
        if (!enemy->alive) continue;
        dx = enemy->x - g_player_x;
        dy = enemy->y - g_player_y;
        forward = dx * dirx + dy * diry;
        if (forward <= (Q12 * Q12 / 2)) continue;
        right = -dx * diry + dy * dirx;
        scaled_forward = forward >> 10;
        if (scaled_forward < 1) continue;

        center = (int)(VIEW_PIXELS_W / 2u) +
                 (int)(((right >> 10) * 73) / scaled_forward);
        if (center < 3 || center > (int)VIEW_PIXELS_W - 4) continue;
        column = (uint8_t)(center >> 1);
        if ((forward >> 12) > (int32_t)g_zbuf[column] + 900) continue;

        height = (int)(560000 / scaled_forward);
        if (height < 8) height = 8;
        if (height > 34) height = 34;
        width = (height * 3) / 5;
        if (width < 7) width = 7;
        sprite->x = (int16_t)(center - width / 2);
        sprite->y = (int16_t)((int)(VIEW_H / 2u) - height / 2);
        sprite->width = (int16_t)width;
        sprite->height = (int16_t)height;
        sprite->depth = (forward >> 12) > 65535 ? 65535u : (uint16_t)(forward >> 12);
        sprite->hurt = (enemy->health == 1u) ? 1u : 0u;
        sprite->valid = (sprite->x >= 1 && sprite->x + sprite->width < (int)VIEW_PIXELS_W - 1 &&
                         sprite->y >= 1 && sprite->y + sprite->height < (int)VIEW_H) ? 1u : 0u;
    }
}

static void chunk_fill_rect(uint16_t row_start, uint8_t rows,
                            int x, int y, int width, int height, uint16_t color)
{
    int left = x;
    int right = x + width;
    int top = y;
    int bottom = y + height;
    int yy;

    if (left < 0) left = 0;
    if (right > (int)VIEW_PIXELS_W) right = VIEW_PIXELS_W;
    if (top < (int)row_start) top = row_start;
    if (bottom > (int)(row_start + rows)) bottom = row_start + rows;
    if (left >= right || top >= bottom) return;

    for (yy = top; yy < bottom; yy++) {
        uint16_t *pixel = &g_frame_buffer[(uint32_t)(yy - row_start) * VIEW_PIXELS_W + left];
        int xx;
        for (xx = left; xx < right; xx++) *pixel++ = color;
    }
}

static void draw_imp_chunk(const ScreenEnemy *sprite, uint16_t row_start, uint8_t rows)
{
    int x = sprite->x;
    int y = sprite->y;
    int width = sprite->width;
    int height = sprite->height;
    uint16_t body = sprite->hurt ? COL_RGB(255, 205, 66) : C_IMP;
    uint16_t light = sprite->hurt ? COL_WHITE : C_IMP_LIGHT;
    int top = y > (int)row_start ? y : (int)row_start;
    int bottom = y + height;
    int yy;

    if (bottom > (int)(row_start + rows)) bottom = row_start + rows;
    for (yy = top; yy < bottom; yy++) {
        int source_y = ((yy - y) * 20) / height;
        int xx;
        for (xx = x; xx < x + width; xx++) {
            int source_x = ((xx - x) * 12) / width;
            char pixel = s_imp_art[source_y][source_x];
            uint8_t ray_column = (uint8_t)(xx >> 1);
            uint16_t color;

            if (pixel == ' ' || ray_column >= VIEW_W ||
                (uint32_t)sprite->depth > (uint32_t)g_zbuf[ray_column] + 700u) continue;
            if (pixel == 'B') color = body;
            else if (pixel == 'L') color = light;
            else if (pixel == 'H') color = C_IMP_HORN;
            else if (pixel == 'Y') color = sprite->hurt ? COL_RED : COL_YELLOW;
            else color = C_IMP_DARK;
            g_frame_buffer[(uint32_t)(yy - row_start) * VIEW_PIXELS_W + xx] = color;
        }
    }
}

static void build_world_chunk(uint16_t row_start, uint8_t rows)
{
    uint8_t row;

    for (row = 0u; row < rows; row++) {
        uint16_t y = (uint16_t)(row_start + row);
        uint16_t *line = &g_frame_buffer[(uint32_t)row * VIEW_PIXELS_W];
        uint8_t x;

        for (x = 0u; x < VIEW_PIXELS_W; x++) {
            uint8_t column = (uint8_t)(x >> 1u);
            uint16_t color;
            if (y < g_wall_top[column]) {
                color = C_CEILING;
            } else if (y < g_wall_bottom[column]) {
                color = g_wall_color[column];
            } else if ((column & 7u) == 0u &&
                       y == (uint16_t)(g_wall_bottom[column] +
                                       (VIEW_H - g_wall_bottom[column]) / 2u)) {
                color = C_FLOOR_LINE;
            } else {
                color = C_FLOOR;
            }
            *line++ = color;
        }
    }
}

static void compose_chunk(uint16_t row_start, uint8_t rows)
{
    uint8_t i;

