jsammarco/ESP32-ST-Link-v2-Clone/RAZ Vape Apps/Doom/src/doom.c
    build_world_chunk(row_start, rows);
    for (i = 0u; i < ENEMY_COUNT; i++) {
        if (g_screen_enemies[i].valid) draw_imp_chunk(&g_screen_enemies[i], row_start, rows);
    }

    chunk_fill_rect(row_start, rows, 44, 47, 9, 1, COL_WHITE);
    chunk_fill_rect(row_start, rows, 48, 43, 1, 9, COL_WHITE);
    chunk_fill_rect(row_start, rows, 47, 46, 3, 3, COL_BLACK);

    /* Draw the weapon inside the same chunk buffer as the world.  It is never
     * temporarily erased by a later column update, which removes the flicker. */
    chunk_fill_rect(row_start, rows, 26, 75, 44, 21, C_GUN_DARK);
    chunk_fill_rect(row_start, rows, 31, 79, 34, 17, C_GUN);
    chunk_fill_rect(row_start, rows, 36, 72, 24, 12, C_GUN_DARK);
    chunk_fill_rect(row_start, rows, 40, 68, 16, 16, C_GUN);
    chunk_fill_rect(row_start, rows, 43, 64, 10, 10, C_GUN_LIGHT);
    chunk_fill_rect(row_start, rows, 46, 61, 4, 7, COL_BLACK);
    chunk_fill_rect(row_start, rows, 34, 84, 28, 4, C_GUN_LIGHT);
    if (g_muzzle_frames) {
        chunk_fill_rect(row_start, rows, 42, 51, 12, 12, COL_YELLOW);
        chunk_fill_rect(row_start, rows, 45, 46, 6, 22, COL_ORANGE);
        chunk_fill_rect(row_start, rows, 39, 55, 18, 5, COL_YELLOW);
    }
}

static void draw_hud(void)
{
    display_fill_rect(0, HUD_Y, LCD_WIDTH, LCD_HEIGHT - HUD_Y, C_HUD);
    display_fill_rect(0, HUD_Y, LCD_WIDTH, 2, C_HUD_EDGE);
    display_fill_rect(42, HUD_Y + 3u, 44, 16, COL_BLACK);
    draw_text(3, HUD_Y + 3u, "HP", 1, COL_RED);
    draw_number(3, HUD_Y + 10u, g_health, 2, COL_WHITE);
    draw_text(49, HUD_Y + 7u, "DOOM", 1, COL_RED);
    draw_text(96, HUD_Y + 3u, "AMMO", 1, COL_YELLOW);
    draw_number(102, HUD_Y + 10u, g_ammo, 2, COL_WHITE);
    draw_text(46, HUD_Y + 15u, "KILLS", 1, C_GUN_LIGHT);
    draw_number(79, HUD_Y + 15u, g_kills, 1, COL_WHITE);
    g_hud_dirty = 0u;
}

static void draw_static_frame(void)
{
    display_fill(COL_BLACK);
    display_fill_rect(VIEW_LEFT - 2u, VIEW_TOP - 2u, VIEW_PIXELS_W + 4u,
                      VIEW_H + 4u, C_HUD_EDGE);
    display_fill_rect(VIEW_LEFT, VIEW_TOP, VIEW_PIXELS_W, VIEW_H, COL_BLACK);
    display_fill_rect(0, 116, LCD_WIDTH, 2, C_HUD_EDGE);
    g_hud_dirty = 1u;
}

static void draw_scene(void)
{
    uint16_t row_start;

    build_wall_projection();
    project_enemies();
    for (row_start = 0u; row_start < VIEW_H; row_start += RENDER_CHUNK_ROWS) {
        uint16_t remaining = (uint16_t)(VIEW_H - row_start);
        uint8_t rows = (remaining < RENDER_CHUNK_ROWS) ? (uint8_t)remaining : RENDER_CHUNK_ROWS;
        compose_chunk(row_start, rows);
        display_draw_image(g_frame_buffer, VIEW_LEFT, (uint16_t)(VIEW_TOP + row_start),
                           VIEW_PIXELS_W, rows);
    }
    if (g_hud_dirty) draw_hud();

    if (g_clear_started) {
        draw_text(24, 26, "AREA CLEAR", 2, COL_YELLOW);
    }
}

static void move_player(void)
{
    int32_t dx = ((int32_t)cos_q12(g_angle) * WALK_STEP) >> 12;
    int32_t dy = ((int32_t)sin_q12(g_angle) * WALK_STEP) >> 12;
    int32_t next_x = g_player_x + dx;
    int32_t next_y = g_player_y + dy;

    if (map_is_open(next_x, g_player_y)) g_player_x = next_x;
    if (map_is_open(g_player_x, next_y)) g_player_y = next_y;
    g_scene_dirty = 1u;
}

static void enemy_step_toward(Enemy *enemy)
{
    int32_t dx = g_player_x - enemy->x;
    int32_t dy = g_player_y - enemy->y;
    int32_t step_x = 0;
    int32_t step_y = 0;

    if (dx > 0) step_x = 92;
    else if (dx < 0) step_x = -92;
    if (dy > 0) step_y = 92;
    else if (dy < 0) step_y = -92;
    if (map_is_open(enemy->x + step_x, enemy->y)) enemy->x += step_x;
    if (map_is_open(enemy->x, enemy->y + step_y)) enemy->y += step_y;
}

static void reset_wave(uint8_t new_game)
{
    uint8_t i;
    if (new_game) {
        g_player_x = Q12 + Q12 / 2;
        g_player_y = Q12 + Q12 / 2;
        g_angle = 0u;
        g_health = 100u;
        g_ammo = 50u;
        g_kills = 0u;
        g_wave = 1u;
        g_dead = 0u;
        g_death_overlay_drawn = 0u;
    } else {
        g_wave++;
        if (g_ammo < 80u) g_ammo = (uint8_t)(g_ammo + 18u);
    }

    for (i = 0u; i < ENEMY_COUNT; i++) {
        g_enemies[i].x = s_spawn_x[i];
        g_enemies[i].y = s_spawn_y[i];
        g_enemies[i].health = (uint8_t)((g_wave > 2u && i > 1u) ? 3u : 2u);
        g_enemies[i].alive = 1u;
    }
    g_clear_started = 0u;
    g_hud_dirty = 1u;
    g_scene_dirty = 1u;
}

static uint8_t enemies_alive(void)
{
    uint8_t i;
    for (i = 0u; i < ENEMY_COUNT; i++) if (g_enemies[i].alive) return 1u;
    return 0u;
}

static void fire_weapon(uint16_t now)
{
    int16_t dirx;
    int16_t diry;
    int best = -1;
    int32_t best_forward = 0x7FFFFFFF;
    uint8_t i;

    if (g_ammo == 0u) return;
    g_ammo--;
    g_muzzle_frames = 2u;
    g_hud_dirty = 1u;
    g_scene_dirty = 1u;
    dirx = cos_q12(g_angle);
    diry = sin_q12(g_angle);

    for (i = 0u; i < ENEMY_COUNT; i++) {
        Enemy *enemy = &g_enemies[i];
        int32_t dx;
        int32_t dy;
        int32_t forward;
        int32_t sideways;
        uint8_t center_col;

        if (!enemy->alive) continue;
        dx = enemy->x - g_player_x;
        dy = enemy->y - g_player_y;
        forward = dx * dirx + dy * diry;
        if (forward <= 0) continue;
        sideways = iabs32(-dx * diry + dy * dirx);
        /* A roughly 14-degree center crosshair cone. */
        if (sideways * 4 >= forward) continue;
        center_col = 32u;
        if ((forward >> 12) > (int32_t)g_zbuf[center_col] + 700) continue;
        if (forward < best_forward) {
            best_forward = forward;
            best = (int)i;
        }
    }

    if (best >= 0) {
        Enemy *enemy = &g_enemies[best];
        if (--enemy->health == 0u) {
            enemy->alive = 0u;
            g_kills++;
            g_hud_dirty = 1u;
        }
    }
    g_last_shot = now;
}

static void update_enemies(uint16_t now)
{
    uint8_t i;

    if ((uint16_t)(now - g_last_enemy_step) >= 230u) {
        g_last_enemy_step = now;
        for (i = 0u; i < ENEMY_COUNT; i++) {
            if (g_enemies[i].alive) enemy_step_toward(&g_enemies[i]);
        }
        g_scene_dirty = 1u;
    }

    if ((uint16_t)(now - g_last_damage) >= 520u) {
        for (i = 0u; i < ENEMY_COUNT; i++) {
            int32_t dx;
            int32_t dy;
            if (!g_enemies[i].alive) continue;
            dx = iabs32(g_enemies[i].x - g_player_x);
            dy = iabs32(g_enemies[i].y - g_player_y);
            if (dx + dy < 2200) {
                g_last_damage = now;
                if (g_health > 8u) g_health = (uint8_t)(g_health - 8u);
                else {
                    g_health = 0u;
                    g_dead = 1u;
                    g_death_overlay_drawn = 0u;
                }
                g_hud_dirty = 1u;
                g_scene_dirty = 1u;
                break;
            }
        }
    }
}

static uint8_t handle_button(uint16_t now)
{
    uint8_t screen_off = 0u;

    /* The press that wakes a manually-dark screen is not a game action. */
    if (g_ignore_wake_release) {
        if (button_just_released()) g_ignore_wake_release = 0u;
        return 0u;
    }

