jsammarco/ESP32-ST-Link-v2-Clone/RAZ Vape Apps/Doom/src/doom.c
    if (button_just_pressed()) {
        g_press_started = now;
        g_long_press = 0u;
        /* Wait to resolve the first tap. This avoids the old right-then-left
         * camera jump when the player intended a double-tap. */
        if (g_tap_pending &&
            (uint16_t)(now - g_tap_started) <= DOUBLE_TAP_MS) {
            g_second_tap = 1u;
        } else {
            if (g_tap_pending) {
                g_angle = (uint8_t)(g_angle + TURN_STEP);
                g_tap_pending = 0u;
                g_scene_dirty = 1u;
            }
            g_second_tap = 0u;
        }
    }

    if (button_pressed() &&
        (uint16_t)(now - g_press_started) >= BUTTON_HOLD_MS) {
        if (!g_long_press || (uint16_t)(now - g_last_walk) >= WALK_REPEAT_MS) {
            g_long_press = 1u;
            /* Tap-then-hold means a completed right tap followed by walking,
             * not an abandoned double-tap gesture. */
            if (g_second_tap) {
                g_angle = (uint8_t)(g_angle + TURN_STEP);
                g_second_tap = 0u;
                g_scene_dirty = 1u;
            }
            g_tap_pending = 0u;
            g_short_clicks = 0u;
            g_last_walk = now;
            move_player();
        }
    }

    if (button_just_released()) {
        if (!g_long_press) {
            if (g_second_tap) {
                g_angle = (uint8_t)(g_angle - TURN_STEP);
                g_tap_pending = 0u;
                g_scene_dirty = 1u;
            } else {
                g_tap_pending = 1u;
                g_tap_started = now;
            }

            if ((uint16_t)(now - g_last_short_click) > SCREEN_OFF_WINDOW) {
                g_short_clicks = 0u;
            }
            g_last_short_click = now;
            if (++g_short_clicks >= SCREEN_OFF_CLICKS) {
                g_short_clicks = 0u;
                g_tap_pending = 0u;
                screen_off = 1u;
            }
        }
        g_second_tap = 0u;
    }

    if (g_tap_pending && (uint16_t)(now - g_tap_started) > DOUBLE_TAP_MS) {
        g_tap_pending = 0u;
        g_angle = (uint8_t)(g_angle + TURN_STEP);
        g_scene_dirty = 1u;
    }
    return screen_off;
}

static void draw_death_screen(void)
{
    display_fill_rect(12, 45, 104, 48, COL_BLACK);
    display_fill_rect(12, 45, 104, 2, COL_RED);
    draw_text(38, 53, "YOU DIED", 2, COL_RED);
    draw_text(31, 74, "DRAW TO RESTART", 1, COL_WHITE);
}

static void turn_screen_off(void)
{
    coil_stop();
    g_screen_off = 1u;
    /* display_sleep_in also turns the panel charge pump/backlight off. */
    display_sleep_in();
}

static void turn_screen_on(void)
{
    display_sleep_out();
    g_screen_off = 0u;
    g_ignore_wake_release = 1u;
    draw_static_frame();
    g_scene_dirty = 1u;
}

void app_init(void)
{
    /* The app framework set up the display at 8 MHz.  Raising to 48 MHz here
     * gives the column renderer a much more responsive SPI bus; tim1_init()
     * restores the 1 kHz game clock after the clock switch. */
    clock_boost_48mhz();
    tim1_init();
    draw_input_init();
    g_coil_active = 0u;
    g_coil_cutoff_latched = 0u;
    coil_stop();
    app_set_sleep_timeout(GAME_SLEEP_TIMEOUT_MS);
    reset_wave(1u);
    g_last_shot = (uint16_t)(ms_now() - SHOT_REPEAT_MS);
    g_last_enemy_step = ms_now();
    g_last_damage = ms_now();
    draw_static_frame();
    g_scene_dirty = 1u;
    draw_scene();
    g_scene_dirty = 0u;
}

void app_update(uint32_t frame)
{
    uint16_t now = ms_now();
    uint8_t drawing;
    (void)frame;

    if (g_screen_off) {
        coil_stop();
        if (button_just_pressed()) {
            turn_screen_on();
        }
        /* Consume the wake press so it does not also turn or walk. */
        return;
    }

    drawing = draw_input_active();
    if (g_dead) {
        if (drawing || button_just_pressed()) {
            reset_wave(1u);
        } else {
            update_coil(frame, now, drawing);
            if (!g_death_overlay_drawn) {
                draw_death_screen();
                g_death_overlay_drawn = 1u;
            }
            return;
        }
    }

    if (handle_button(now)) {
        turn_screen_off();
        return;
    }
    update_coil(frame, now, drawing);
    if (drawing && (uint16_t)(now - g_last_shot) >= SHOT_REPEAT_MS) {
        fire_weapon(now);
    }

    update_enemies(now);
    if (g_dead) coil_stop();
    if (!enemies_alive() && !g_clear_started) g_clear_started = now;
    if (g_clear_started && (uint16_t)(now - g_clear_started) >= 1800u) reset_wave(0u);

    if (g_scene_dirty) {
        draw_scene();
        g_scene_dirty = 0u;
        if (g_muzzle_frames) {
            g_muzzle_frames--;
            if (g_muzzle_frames) g_scene_dirty = 1u;
        }
    } else if (g_hud_dirty) {
        draw_hud();
    }
    if (g_dead && !g_death_overlay_drawn) {
        draw_death_screen();
        g_death_overlay_drawn = 1u;
    }
}

void app_wake(void)
{
    /* system_enter_stop() resumes at the HSI clock; restore the game clock. */
    clock_boost_48mhz();
    tim1_init();
    draw_input_init();
    g_coil_cutoff_latched = 0u;
    coil_stop();
    g_screen_off = 0u;
    draw_static_frame();
    if (g_dead) g_death_overlay_drawn = 0u;
    g_scene_dirty = 1u;
    draw_scene();
    g_scene_dirty = 0u;
    if (g_dead) {
        draw_death_screen();
        g_death_overlay_drawn = 1u;
    }
}
